app/controllers/basecamp_accounts_controller.rb

  def create
    @basecamp_account = current_user \
      .basecamp_accounts \
      .build( params[:basecamp_account] )
    if @basecamp_account.save! #and @basecamp_account.can_connect?
---
INSERT INTO "basecamp_accounts" ("name", "created_at", "updated_at", "username", "user_id", "password", "account_name") VALUES(NULL, '2009-11-25 20:50:07', '2009-11-25 20:50:07', 'ryandotmsith', 1, 'whatever ', NULL)

  def destroy
    BasecampAccount.find(params[:id]).destroy
---
DELETE FROM "basecamp_accounts" WHERE "id" = 2
SELECT * FROM "basecamp_accounts" WHERE ("basecamp_accounts"."id" = 2)