app/controllers/profile_page_controller.rb

  def show
    if params[:id]
      @user = User.find( params[:id] )
---
SELECT * FROM "users" WHERE ("users"."id" = 1)