app/controllers/todo_lists_controller.rb

  def index
    @todo_items = @user.base_todo_lists.collect {|list| list.base_todo_items}.flatten
---
SELECT * FROM "base_todo_items" WHERE ("base_todo_items".base_todo_list_id = 4)
SELECT * FROM "base_todo_lists" WHERE ("base_todo_lists".user_id = 1)

  def create
    @todo_list = @user.base_todo_lists.build(params[:todo_list])
    if @todo_list.save!
---
INSERT INTO "base_todo_lists" ("created_at", "updated_at", "user_id", "basecamp_id") VALUES('2009-12-09 05:34:13', '2009-12-09 05:34:13', 1, 12345)

  def destroy
    BaseTodoList.find(params[:id]).destroy
---
DELETE FROM "base_todo_lists" WHERE "id" = 1
SELECT * FROM "base_todo_lists" WHERE ("base_todo_lists"."id" = 1)

  def load_user
    user_id = params[:user_id]
    @user = User.find user_id unless user_id.nil?
---
SELECT * FROM "users" WHERE ("users"."id" = 1)