app/controllers/todo_items_controller.rb

  def edit
    @todo_item = BaseTodoItem.find(params[:id])
---
SELECT * FROM "base_todo_items" WHERE ("base_todo_items"."id" = 46)

  def update
    @todo_item = BaseTodoItem.find(params[:id])
---
SELECT * FROM "base_todo_items" WHERE ("base_todo_items"."id" = 46)

  def create
    @todo_list = BaseTodoList.find_by_basecamp_id(params[:todo_list][:basecamp_id])
    @todo_list = @user.base_todo_lists.build(params[:todo_list]) if @todo_list.nil?
    @todo_item = @todo_list.base_todo_items.build(params[:todo_item])
    if @todo_item.save! and @todo_list.save!
---
SELECT * FROM "base_todo_lists" WHERE ("base_todo_lists"."basecamp_id" = '32316895') LIMIT 1
INSERT INTO "base_todo_items" ("created_at", "updated_at", "base_todo_list_id", "basecamp_id") VALUES('2009-12-09 16:16:34', '2009-12-09 16:16:34', NULL, 32316895)
INSERT INTO "base_todo_lists" ("created_at", "updated_at", "user_id", "basecamp_id") VALUES('2009-12-09 16:16:34', '2009-12-09 16:16:34', 1, 32316895)
UPDATE "base_todo_items" SET "updated_at" = '2009-12-09 16:16:34', "base_todo_list_id" = 5 WHERE "id" = 4

  def load_user
    user_id = params[:user_id]
    @user = User.find user_id unless user_id.nil?
---
SELECT * FROM "users" WHERE ("users"."id" = 1)